{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020-2021)"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AbdulsamadSethi",
  "highlighted_projects": [
    {
      "description": "Designed an Python application where a user can follow along an exercise routine by a trainer on a video, and dynamically receive real-time feedback on quality of form as a score. Developed application's body tracking algorithm in Python using OpenCV and TensorFlow. Implemented neural networking and dynamic time warping to compute real-time user scoring metrics.",
      "git_url": "https://github.com/AbdulSamadSethi/Intelligent-Personal-Trainer",
      "name": "AI Personal Trainer"
    },
    {
      "description": "Developed an C application that allows files and media to be exchanged among connected peer networks. Implemented UDP and TCP connections with an index server and peer networks using sockets in C. Integrated functionalities that allowed the user to upload and delete files that are shared with other connected peer networks via the index server.",
      "git_url": null,
      "name": "Peer-to-Peer Application"
    },
    {
      "description": "Created a Music Database with SQLite that allowed the user to search for any information about an album, artist, or song through executed user queries. Translated the SQLite database into an XML schema allowing for better visualization of the user queries.",
      "git_url": null,
      "name": "Music Database"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a tool using bash scripts that gathers data on hardware specifications of a network of Linux Machines. This application monitors their resource usage in real time, and stores the data to a PostgreSQL database maintained in a docker instance.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a Twitter CLI application that implemented Maven, Mockito, JSON, Spring, JUnit, and the Twitter API to allow users to post, search and delete tweets from the command line. Performed agile testing creating and executing JUnit test scripts for the application, and deployed the application using Docker to DockerHub.",
        "JDBC App: Implemented an application to store customer and sales data for a sample enterprise for the purpose of exploring the JDBC library and common data persistence design patterns. This application was developed using Java with a PostgreSQL instance for data storage which was maintained within a docker container.",
        "Grep App: Developed an application that mirrors the Linux bash grep function. This application was developed using Java to search for a matching regex pattern in a directory."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Abdul Samad Sethi",
  "others": [
    {
      "bullets": [
        "Rock Climbing/Bouldering"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed Data Engineering projects in Java while also using other technologies such as Maven, Docker, Git, PSQL, and REST APIs. Collaborated with a team in daily scrum meetings and bi-weekly sprint meetings to implement Agile development practices to help guide individual work flow.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "St. Joseph Secondary School",
      "description": "Responsible for assisting a secondary school teacher in delivering the grade 10 math curriculum to a class of 27 grade 10 students for over four months. Supported students by identifying their weaknesses and collaborating with the students to improve their mathematical skills resulting in successful completion of the course.",
      "duration": "2017",
      "title": "Math Teaching Assistant (Co-op)"
    }
  ],
  "skills": {
    "competent": [
      "Rest APIs",
      "C++",
      "CSS",
      "JavaScript",
      "OpenCV"
    ],
    "familiar": [
      "Ruby on Rails",
      "Swift",
      "AngularJS",
      "Azure",
      "TensorFlow"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "C",
      "MATLAB",
      "VHDL",
      "Python",
      "HTML",
      "Docker"
    ]
  },
  "summary": "I am a recent graduate from Ryerson University where I received my Bachelor of Engineering, majoring in Computer Engineering. Throughout my education at Ryerson University, I developed strong analytical, problem solving and coding skills. Furthermore, I have a strong fundamental understanding of Data Structures and Algorithms. I began to take interest in Data engineering in my final year at Ryerson University and quickly discovered that it includes all aspects of software development that I am passionate about. I developed multiple projects at Ryerson most notably an AI Personal Trainer that was able to collect data in real-time and give the user feedback on their workout routine. I believe myself to be a hardworking and highly motivated individual that enjoys being challenged when engaging with projects that require me to learn new programming languages and development techniques. I believe that clear communication streams and increased transparency can help organizations build highly efficient, confident and successful teams that are capable of creating the desired products for the consumers. Ultimately, I feel that my strong academic background in Computer and Data Engineering will enable me to excel and have a meaningful contribution to your team."
}
